; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-1 - location
	p0-5 - location
	p0-6 - location
	p1-3 - location
	p1-6 - location
	p1-7 - location
	p3-4 - location
	p4-5 - location
	p4-7 - location
	p5-6 - location
	p5-7 - location
	p5-8 - location
	p6-4 - location
	p7-2 - location
	p8-0 - location
	p8-2 - location
	p8-4 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s6)
	(at driver5 s5)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s8)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s7)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s8)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s1)
	(at package2 s2)
	(at package3 s0)
	(at package4 s6)
	(at package5 s3)
	(at package6 s7)
	(at package7 s8)
	(at package8 s5)
	(at package9 s3)
	(at package10 s1)
	(at package11 s7)
	(at package12 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 38)
	(= (time-to-drive s1 s0) 38)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 38)
	(= (time-to-drive s2 s0) 38)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 53)
	(= (time-to-drive s6 s0) 53)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 17)
	(= (time-to-drive s8 s0) 17)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 4)
	(= (time-to-drive s7 s1) 4)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 57)
	(= (time-to-drive s8 s1) 57)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 31)
	(= (time-to-drive s1 s2) 31)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 57)
	(= (time-to-drive s4 s2) 57)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 39)
	(= (time-to-drive s1 s3) 39)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 49)
	(= (time-to-drive s8 s3) 49)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 6)
	(= (time-to-drive s0 s4) 6)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 89)
	(= (time-to-drive s3 s4) 89)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 76)
	(= (time-to-drive s5 s4) 76)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 11)
	(= (time-to-drive s0 s5) 11)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 62)
	(= (time-to-drive s1 s5) 62)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 30)
	(= (time-to-drive s2 s5) 30)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 59)
	(= (time-to-drive s6 s5) 59)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 39)
	(= (time-to-drive s4 s6) 39)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 19)
	(= (time-to-drive s6 s7) 19)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 24)
	(= (time-to-drive s8 s7) 24)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 19)
	(= (time-to-drive s2 s8) 19)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 55)
	(= (time-to-drive s5 s8) 55)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s8)
	(at driver3 s4)
	(at driver4 s8)
	(at driver5 s3)
	(at truck2 s0)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s0)
	(at package1 s0)
	(at package2 s3)
	(at package3 s3)
	(at package4 s0)
	(at package5 s5)
	(at package7 s6)
	(at package8 s2)
	(at package9 s0)
	(at package10 s0)
	(at package11 s1)
	(at package12 s4)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (walk driver5 s5 p4-5)
   deleted: (at driver5 s5)
   added: (at driver5 p4-5)
   goals met: 0 of 19
2. (walk driver5 p4-5 s4)
   deleted: (at driver5 p4-5)
   added: (at driver5 s4)
   goals met: 0 of 19
3. (board-truck driver5 truck3 s4)
   deleted: (at driver5 s4) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 0 of 19
4. (drive-truck truck3 s4 s0 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 0 to 60
   goals met: 0 of 19
5. (walk driver2 s2 p7-2)
   deleted: (at driver2 s2)
   added: (at driver2 p7-2)
   goals met: 0 of 19
6. (walk driver2 p7-2 s7)
   deleted: (at driver2 p7-2)
   added: (at driver2 s7)
   goals met: 0 of 19
7. (load-truck package3 truck3 s0)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 0 of 19
8. (load-truck package11 truck4 s7)
   deleted: (at package11 s7)
   added: (in package11 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 0 of 19
9. (drive-truck truck3 s0 s5 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 60 to 181
   goals met: 0 of 19
10. (load-truck package8 truck3 s5)
   deleted: (at package8 s5)
   added: (in package8 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 0 of 19
11. (drive-truck truck3 s5 s4 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 181 to 1169
   goals met: 0 of 19
12. (walk driver3 s0 p8-0)
   deleted: (at driver3 s0)
   added: (at driver3 p8-0)
   goals met: 0 of 19
13. (board-truck driver2 truck4 s7)
   deleted: (at driver2 s7) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 0 of 19
14. (drive-truck truck3 s4 s3 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 1169 to 2326
   goals met: 0 of 19
15. (load-truck package5 truck3 s3)
   deleted: (at package5 s3)
   added: (in package5 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 0 of 19
16. (unload-truck package3 truck3 s3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 1 of 19
17. (load-truck package9 truck3 s3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 1 of 19
18. (drive-truck truck3 s3 s4 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (fuel-used) from 2326 to 3750
   goals met: 1 of 19
19. (walk driver3 p8-0 s8)
   deleted: (at driver3 p8-0)
   added: (at driver3 s8)
   goals met: 1 of 19
20. (drive-truck truck3 s4 s0 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 3750 to 3846
   goals met: 1 of 19
21. (unload-truck package9 truck3 s0)
   deleted: (in package9 truck3)
   added: (at package9 s0)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 2 of 19
22. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 3846 to 4340
   goals met: 3 of 19
23. (load-truck package10 truck3 s1)
   deleted: (at package10 s1)
   added: (in package10 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 3 of 19
24. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 3 of 19
25. (drive-truck truck3 s1 s5 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 4340 to 5580
   goals met: 2 of 19
26. (unload-truck package5 truck3 s5)
   deleted: (in package5 truck3)
   added: (at package5 s5)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 3 of 19
27. (drive-truck truck3 s5 s2 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 5580 to 6060
   goals met: 3 of 19
28. (unload-truck package8 truck3 s2)
   deleted: (in package8 truck3)
   added: (at package8 s2)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 4 of 19
29. (load-truck package12 truck3 s2)
   deleted: (at package12 s2)
   added: (in package12 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 4 of 19
30. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 4 of 19
31. (drive-truck truck3 s2 s0 driver5)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 6060 to 6820
   goals met: 4 of 19
32. (unload-truck package10 truck3 s0)
   deleted: (in package10 truck3)
   added: (at package10 s0)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 5 of 19
33. (unload-truck package1 truck3 s0)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 6 of 19
34. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 6820 to 7314
   goals met: 7 of 19
35. (drive-truck truck4 s7 s6 driver2)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (fuel-used) from 7314 to 7523
   goals met: 7 of 19
36. (load-truck package4 truck4 s6)
   deleted: (at package4 s6)
   added: (in package4 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 7 of 19
37. (drive-truck truck4 s6 s0 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   changed: (fuel-used) from 7523 to 8212
   goals met: 8 of 19
38. (unload-truck package4 truck4 s0)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 9 of 19
39. (walk driver3 s8 p8-4)
   deleted: (at driver3 s8)
   added: (at driver3 p8-4)
   goals met: 9 of 19
40. (drive-truck truck3 s1 s3 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 8212 to 8719
   goals met: 8 of 19
41. (unload-truck package2 truck3 s3)
   deleted: (in package2 truck3)
   added: (at package2 s3)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 9 of 19
42. (walk driver3 p8-4 s4)
   deleted: (at driver3 p8-4)
   added: (at driver3 s4)
   goals met: 10 of 19
43. (drive-truck truck4 s0 s8 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (fuel-used) from 8719 to 8906
   goals met: 9 of 19
44. (walk driver4 s6 p5-6)
   deleted: (at driver4 s6)
   added: (at driver4 p5-6)
   goals met: 9 of 19
45. (walk driver4 p5-6 s5)
   deleted: (at driver4 p5-6)
   added: (at driver4 s5)
   goals met: 9 of 19
46. (walk driver4 s5 p5-8)
   deleted: (at driver4 s5)
   added: (at driver4 p5-8)
   goals met: 9 of 19
47. (walk driver4 p5-8 s8)
   deleted: (at driver4 p5-8)
   added: (at driver4 s8)
   goals met: 10 of 19
48. (drive-truck truck4 s8 s0 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (fuel-used) from 8906 to 9093
   goals met: 11 of 19
49. (disembark-truck driver5 truck3 s3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s3) (empty truck3)
   goals met: 12 of 19
50. (board-truck driver4 truck2 s8)
   deleted: (at driver4 s8) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 11 of 19
51. (drive-truck truck4 s0 s8 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (fuel-used) from 9093 to 9280
   goals met: 10 of 19
52. (load-truck package7 truck4 s8)
   deleted: (at package7 s8)
   added: (in package7 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 10 of 19
53. (drive-truck truck4 s8 s0 driver2)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (fuel-used) from 9280 to 9501
   goals met: 11 of 19
54. (disembark-truck driver4 truck2 s8)
   deleted: (driving driver4 truck2)
   added: (at driver4 s8) (empty truck2)
   goals met: 12 of 19
55. (board-truck driver4 truck5 s8)
   deleted: (at driver4 s8) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 11 of 19
56. (drive-truck truck4 s0 s1 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 9501 to 9995
   goals met: 10 of 19
57. (unload-truck package11 truck4 s1)
   deleted: (in package11 truck4)
   added: (at package11 s1)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 11 of 19
58. (drive-truck truck4 s1 s0 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 9995 to 10413
   goals met: 12 of 19
59. (disembark-truck driver4 truck5 s8)
   deleted: (driving driver4 truck5)
   added: (at driver4 s8) (empty truck5)
   goals met: 13 of 19
60. (drive-truck truck4 s0 s6 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   changed: (fuel-used) from 10413 to 10996
   goals met: 12 of 19
61. (unload-truck package7 truck4 s6)
   deleted: (in package7 truck4)
   added: (at package7 s6)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 13 of 19
62. (drive-truck truck4 s6 s0 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   changed: (fuel-used) from 10996 to 11526
   goals met: 14 of 19
63. (board-truck driver5 truck3 s3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 13 of 19
64. (drive-truck truck4 s0 s8 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (fuel-used) from 11526 to 11696
   goals met: 12 of 19
65. (drive-truck truck3 s3 s4 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (fuel-used) from 11696 to 12675
   goals met: 12 of 19
66. (unload-truck package12 truck3 s4)
   deleted: (in package12 truck3)
   added: (at package12 s4)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 13 of 19
67. (board-truck driver4 truck5 s8)
   deleted: (at driver4 s8) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 12 of 19
68. (disembark-truck driver2 truck4 s8)
   deleted: (driving driver2 truck4)
   added: (at driver2 s8) (empty truck4)
   goals met: 13 of 19
69. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 19
70. (disembark-truck driver4 truck5 s8)
   deleted: (driving driver4 truck5)
   added: (at driver4 s8) (empty truck5)
   goals met: 13 of 19
71. (board-truck driver4 truck4 s8)
   deleted: (at driver4 s8) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 12 of 19
72. (disembark-truck driver2 truck2 s8)
   deleted: (driving driver2 truck2)
   added: (at driver2 s8) (empty truck2)
   goals met: 13 of 19
73. (drive-truck truck3 s4 s5 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 12675 to 13435
   goals met: 13 of 19
74. (drive-truck truck3 s5 s8 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s8)
   changed: (fuel-used) from 13435 to 13985
   goals met: 13 of 19
75. (disembark-truck driver4 truck4 s8)
   deleted: (driving driver4 truck4)
   added: (at driver4 s8) (empty truck4)
   goals met: 14 of 19
76. (board-truck driver4 truck5 s8)
   deleted: (at driver4 s8) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 13 of 19
77. (board-truck driver2 truck4 s8)
   deleted: (at driver2 s8) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 19
78. (disembark-truck driver5 truck3 s8)
   deleted: (driving driver5 truck3)
   added: (at driver5 s8) (empty truck3)
   goals met: 12 of 19
79. (board-truck driver5 truck2 s8)
   deleted: (at driver5 s8) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 12 of 19
80. (disembark-truck driver2 truck4 s8)
   deleted: (driving driver2 truck4)
   added: (at driver2 s8) (empty truck4)
   goals met: 13 of 19
81. (disembark-truck driver4 truck5 s8)
   deleted: (driving driver4 truck5)
   added: (at driver4 s8) (empty truck5)
   goals met: 14 of 19
82. (board-truck driver4 truck4 s8)
   deleted: (at driver4 s8) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 13 of 19
83. (board-truck driver2 truck3 s8)
   deleted: (at driver2 s8) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 12 of 19
84. (drive-truck truck3 s8 s1 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   changed: (fuel-used) from 13985 to 14555
   goals met: 13 of 19
85. (drive-truck truck2 s8 s0 driver5)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (fuel-used) from 14555 to 14725
   goals met: 14 of 19
86. (disembark-truck driver5 truck2 s0)
   deleted: (driving driver5 truck2)
   added: (at driver5 s0) (empty truck2)
   goals met: 14 of 19
87. (drive-truck truck3 s1 s8 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s8)
   changed: (fuel-used) from 14725 to 15295
   goals met: 13 of 19
88. (disembark-truck driver2 truck3 s8)
   deleted: (driving driver2 truck3)
   added: (at driver2 s8) (empty truck3)
   goals met: 14 of 19
89. (drive-truck truck4 s8 s0 driver4)
   deleted: (at truck4 s8)
   added: (at truck4 s0)
   changed: (fuel-used) from 15295 to 15465
   goals met: 15 of 19
90. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 15 of 19
91. (walk driver4 s0 p8-0)
   deleted: (at driver4 s0)
   added: (at driver4 p8-0)
   goals met: 15 of 19
92. (board-truck driver2 truck5 s8)
   deleted: (at driver2 s8) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 14 of 19
93. (walk driver4 p8-0 s8)
   deleted: (at driver4 p8-0)
   added: (at driver4 s8)
   goals met: 15 of 19
94. (drive-truck truck5 s8 s0 driver2)
   deleted: (at truck5 s8)
   added: (at truck5 s0)
   changed: (fuel-used) from 15465 to 15635
   goals met: 16 of 19
95. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 16 of 19
96. (board-truck driver4 truck3 s8)
   deleted: (at driver4 s8) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 15 of 19
97. (walk driver2 s0 p8-0)
   deleted: (at driver2 s0)
   added: (at driver2 p8-0)
   goals met: 15 of 19
98. (walk driver2 p8-0 s8)
   deleted: (at driver2 p8-0)
   added: (at driver2 s8)
   goals met: 16 of 19
99. (drive-truck truck3 s8 s0 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   changed: (fuel-used) from 15635 to 15805
   goals met: 16 of 19
100. (disembark-truck driver4 truck3 s0)
   deleted: (driving driver4 truck3)
   added: (at driver4 s0) (empty truck3)
   goals met: 16 of 19
101. (walk driver5 s0 p0-1)
   deleted: (at driver5 s0)
   added: (at driver5 p0-1)
   goals met: 16 of 19
102. (walk driver4 s0 p8-0)
   deleted: (at driver4 s0)
   added: (at driver4 p8-0)
   goals met: 16 of 19
103. (walk driver4 p8-0 s8)
   deleted: (at driver4 p8-0)
   added: (at driver4 s8)
   goals met: 17 of 19
104. (walk driver5 p0-1 s1)
   deleted: (at driver5 p0-1)
   added: (at driver5 s1)
   goals met: 17 of 19
105. (walk driver5 s1 p1-3)
   deleted: (at driver5 s1)
   added: (at driver5 p1-3)
   goals met: 17 of 19
106. (walk driver5 p1-3 s3)
   deleted: (at driver5 p1-3)
   added: (at driver5 s3)
   goals met: 18 of 19
107. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 18 of 19
108. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 15805 to 16185
   goals met: 19 of 19
